tutorials/icoLagrangianFoam/channelParticles/constant/injectorProperties
/*---------------------------------------------------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.0                                   |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version         2.0;
    format          ascii;

    root            "";
    case            "";
    instance        "";
    local           "";

    class           dictionary;
    object          injectorProperties;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

(
    {
        position        (0.01 0.05 0.005);
        direction       (1 0 0);
        startTime       0.2;
        endTime         0.8;
        nParticles      20;
    }

    {
        position        (0.01 0.095 0.005);
        direction       (1 0 0);
        startTime       0;
        endTime         1;
        nParticles      60;
    }
)


// ************************************************************************* //
