tutorials/icoLagrangianFoam/channelParticles/constant/polyMesh/blockMeshDict
/*---------------------------------------------------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.0                                   |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version         2.0;
    format          ascii;

    root            "";
    case            "";
    instance        "";
    local           "";

    class           dictionary;
    object          blockMeshDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


convertToMeters 0.1;

vertices        
(
    (0 0 0)
    (10 0 0)
    (10 1 0)
    (0 1 0)
    (0 0 0.1)
    (10 0 0.1)
    (10 1 0.1)
    (0 1 0.1)
);

blocks          
(
    hex (0 1 2 3 4 5 6 7) (100 10 1) simpleGrading (1 1 1)
);

edges           
(
);

patches         
(
    wall topAndBottom 
    (
        (3 7 6 2)
        (1 5 4 0)
    )
    patch in
    (
        (0 4 7 3)
    )
    patch out
    (
        (2 6 5 1)
    )
    empty frontAndBack 
    (
        (0 3 2 1)
        (4 5 6 7)
    )
);

mergePatchPairs 
(
);


// ************************************************************************* //
